Конфигурация/src/Catalogs/ЭтапыПроекта/ЭтапыПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭтапыПроекта</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Видео</name>
    <type>
      <types>CatalogRef.ЭтапыПроектаПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.ТипЭтапа</types>
    </type>
  </attributes>
  <attributes>
    <name>РасшифровкаВидео</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДетализацияРасшифровки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Таблица</name>
    <attributes>
      <name>Колонка1</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Колонка2</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конфигурация/src/Enums/ТипЭтапа/ТипЭтапа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЭтапа</name>
  <enumValues>
    <name>Видео</name>
  </enumValues>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>Обсуждение</name>
  </enumValues>
  <enumValues>
    <name>Протокол</name>
  </enumValues>
  <enumValues>
    <name>Задачи</name>
  </enumValues>
  <enumValues>
    <name>Аудио</name>
  </enumValues>
  <enumValues>
    <name>РасшифровкаВидео</name>
  </enumValues>
  <enumValues>
    <name>ОбработаннаяРасшифровка</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Catalogs/ЭтапыПроекта/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ТипЭтапаПриИзменении(Элемент)
	
	ВидимостьГруппаВидео(Объект.Родитель, Объект.ТипЭтапа);

КонецПроцедуры
#КонецОбласти






&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	ГиперссылкаФайлов = РаботаСФайлами.ГиперссылкаФайлов();
	ГиперссылкаФайлов.Размещение = "Файлы";
	РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ГиперссылкаФайлов);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	ВидимостьГруппаВидео(Объект.Родитель,Объект.ТипЭтапа);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);
	// Конец СтандартныеПодсистемы.РаботаСФайлами
	
	ВидимостьГруппаВидео(Объект.Родитель,Объект.ТипЭтапа);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.РаботаСФайлами
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	// Конец СтандартныеПодсистемы.РаботаСФайлами

КонецПроцедуры


// СтандартныеПодсистемы.РаботаСФайлами
&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)

	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);

КонецПроцедуры
// Конец СтандартныеПодсистемы.РаботаСФайлами

//ВидимостьПолей
&НаСервере
Процедура ВидимостьГруппаВидео(Родитель, Признак)
	
	Элементы.Видео.Видимость = Ложь;
	Элементы.РасшифровкаВидео.Видимость = Ложь;
	Элементы.ДетализацияРасшифровки.Видимость = Ложь;
	
	Если Признак = Перечисления.ТипЭтапа.Видео Тогда
		Элементы.Видео.Видимость = Истина;
	ИначеЕсли Признак = Перечисления.ТипЭтапа.РасшифровкаВидео Тогда
		Элементы.РасшифровкаВидео.Видимость = Истина;
	ИначеЕсли Признак = Перечисления.ТипЭтапа.ОбработаннаяРасшифровка Тогда
		Элементы.ДетализацияРасшифровки.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры
//Конец ВидимостьПолей
